电脑/python/python第三方模块/setuptools模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-02-25 四 10:36 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>setuptools模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">setuptools模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 安装</a></li>
<li><a href="#orgheadline2">2. setuptools基础</a></li>
<li><a href="#orgheadline3">3. pkg_resources模块来管理读取资源文件</a></li>
<li><a href="#orgheadline4">4. 在pypi上注册你的软件</a></li>
<li><a href="#orgheadline5">5. 在pypi上上传你的软件</a></li>
<li><a href="#orgheadline6">6. 一个项目模板</a></li>
</ul>
</div>
</nav>
<p>
虽然官方内置distutils模块也能实现类似的功能，不过现在人们更常用的是第三方模块setuptools，相当于distutils模块的加强版，初学者推荐就使用setuptools模块。更多内容请参看 <a href="https://pythonhosted.org/setuptools/index.html">官方文档</a> 。
</p>

<div class="outline-2">
<h2 id="orgheadline1">安装</h2>
<div class="outline-text-2" id="text-1">
<p>
安装就是先安装pip3：
</p>
<pre>
sudo apt-get install python3-pip
</pre>


<p>
然后通过pip3来安装setuptools：
</p>
<pre>
sudo pip3 install setuptools
</pre>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline2">setuptools基础</h2>
<div class="outline-text-2" id="text-2">
<p>
安装官方文档最简单的“setup.py”文件如下所示：
</p>
<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">setuptools</span> <span class="kn">import</span> <span class="n">setup</span><span class="p">,</span> <span class="n">find_packages</span>
<span class="n">setup</span><span class="p">(</span>
    <span class="n">name</span> <span class="o">=</span> <span class="s2">&quot;HelloWorld&quot;</span><span class="p">,</span>
    <span class="n">version</span> <span class="o">=</span> <span class="s2">&quot;0.1&quot;</span><span class="p">,</span>
    <span class="n">packages</span> <span class="o">=</span> <span class="n">find_packages</span><span class="p">(),</span>
<span class="p">)</span>
</pre></div>

<p>
第一行是从setuptools模块中引入setup函数和find_packages函数。
</p>

<p>
setup函数接受一系列的字典值，下面就setup函数的一些字典值的含义慢慢道来：
</p>

<dl class="org-dl">
<dt>name</dt><dd>本软件的名字</dd>
<dt>version</dt><dd>本软件的版本号</dd>
<dt>author</dt><dd>本软件的作者</dd>
<dt>author_email</dt><dd>本软件作者的邮箱</dd>
<dt>maintainer</dt><dd>本软件的维护者</dd>
<dt>maintainer_email</dt><dd>本软件维护者的邮箱</dd>
<dt>contact</dt><dd>本软件的联系人。可以不写，则是维护者的名字，如果没有则是作者的名字。</dd>
<dt>contact_email</dt><dd>本软件的联系人的邮箱，可以不写，则是维护者的邮箱，如果没有则是作者的邮箱。</dd>
<dt>license</dt><dd>本软件的license</dd>
<dt>url</dt><dd>本软件项目主页地址</dd>
<dt>description</dt><dd>本软件的简要描述</dd>
<dt>long_description</dt><dd>本软件的完整描述，一般如下定义一行函数，然后读取本地目录下面README.md文件。</dd>
</dl>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">os.path</span>
<span class="k">def</span> <span class="nf">read</span><span class="p">(</span><span class="n">fname</span><span class="p">):</span>
    <span class="k">return</span> <span class="nb">open</span><span class="p">(</span><span class="n">os</span><span class="o">.</span><span class="n">path</span><span class="o">.</span><span class="n">join</span><span class="p">(</span><span class="n">os</span><span class="o">.</span><span class="n">path</span><span class="o">.</span><span class="n">dirname</span><span class="p">(</span><span class="n">__file__</span><span class="p">),</span> <span class="n">fname</span><span class="p">))</span><span class="o">.</span><span class="n">read</span><span class="p">()</span>
</pre></div>

<p>
然后long_description如下设置：
</p>
<div class="highlight"><pre><span></span><span class="n">long_description</span><span class="o">=</span><span class="n">read</span><span class="p">(</span><span class="s1">&#39;README.md&#39;</span><span class="p">),</span>
</pre></div>

<dl class="org-dl">
<dt>platforms</dt><dd>本软件经过测试可运行的平台</dd>
<dt>classifiers</dt><dd>本软件的分类，请参考<a href="https://pypi.python.org/pypi?:action=list_classifiers">这个网页</a> 给出一些值。是字符串的列表。</dd>
<dt>keywords</dt><dd>本软件在pypi上搜索的关键词，字符串的列表。</dd>
<dt>packages</dt><dd>你的软件依赖的模块。一般如下使用：</dd>
</dl>

<div class="highlight"><pre><span></span><span class="n">packages</span> <span class="o">=</span> <span class="n">find_packages</span><span class="p">(),</span>
</pre></div>

<p>
则你文件夹下有 <code>__init__.py</code> 文件的都将视作python模块并加入进去。
</p>

<p>
除此之外你也可以直接手工输入你的模块名字，具体就是字符串的列表。
</p>
<dl class="org-dl">
<dt>entry_point</dt><dd>entry_point属性视图解决在Linux <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 下的脚本调用问题。如下所示：</dd>
</dl>

<div class="highlight"><pre><span></span><span class="n">entry_points</span> <span class="o">=</span> <span class="p">{</span>
<span class="s1">&#39;console_scripts&#39;</span> <span class="p">:[</span> <span class="s1">&#39;zwc=zwc.zwc:main&#39;</span><span class="p">,],</span>
<span class="p">}</span>
</pre></div>

<p>
其中zwc是你的shell调用的名字，然后zwc是你的模块，另外一个zwc是你的主模块的子模块，然后main是其中的main函数。这就是你的shell调用程序的接口了。类似的还有gui_script可以控制你调用GUI图形的命令入口。
</p>

<dl class="org-dl">
<dt>install_requires</dt><dd>接受字符串的列表值，将你依赖的可以通过pip安装的模块名放入进去，然后你的软件安装会自动检测并安装这些依赖模块。</dd>

<dt>setup_requires</dt><dd>和 <code>install_requires</code> 类似，所不同的是这个更加侧重于本 <code>setup.py</code> 所需要的依赖。然后注意 <code>setup_requires</code> 只是把依赖模块下载下来，还没有具体安装，因为 <code>setup.py</code> 具体还在执行。如果你希望某个依赖模块至于 <code>setup.py</code> 就可用，则需要将该依赖模块加入到 <code>install_requires</code> 和 <code>setup_requires</code> 中。</dd>
</dl>


<dl class="org-dl">
<dt>package_data</dt><dd>你的软件的模块额外附加的（除了py文件的）其他文件，具体设置类似这样 <code>{"skeleton":['*.txt'],}</code> 其中skeleton这里就是具体的你的软件的模块（对应的文件夹名），然后后面跟着的就是一系列的文件名列表，可以接受glob语法。注意这里只能包含你的模块文件夹也就是前面通过packages控制的文件夹下面的内容。</dd>
<dt>include_package_data</dt><dd>这个一般设置为True，似乎可以省略？</dd>
</dl>

<p>
其他不常用的属性值列在下面：
</p>
<dl class="org-dl">
<dt>scripts</dt><dd>不推荐使用，推荐通过entry_point来生成脚本。</dd>
<dt>py_modules</dt><dd>不推荐使用，推荐使用packages来管理模块。</dd>
<dt>data_files</dt><dd>前面的package_data是只能在你的模块文件夹里面的其他数据文件等，然后可能还有一些数据文件你需要包含的，用data_files来控制，具体后面跟着的参数格式如下面例子所示：</dd>
</dl>
<div class="highlight"><pre><span></span><span class="n">data_files</span> <span class="o">=</span> <span class="p">[(</span><span class="s1">&#39;icos&#39;</span><span class="p">,[</span><span class="s1">&#39;icos/wise.ico&#39;</span><span class="p">])],</span>
<span class="c1">#这是添加的icos文件夹下面的wise.ico文件</span>
<span class="n">data_files</span> <span class="o">=</span> <span class="p">[(</span><span class="s1">&#39;&#39;</span><span class="p">,[</span><span class="s1">&#39;skeleton.tar.gz&#39;</span><span class="p">])],</span>
<span class="c1">#这是添加的主目录下的skeleton.tar.gz文件</span>
</pre></div>

<p>
值得一提的是data_files不能接受glob语法。
</p>

<p>
data_files已经不推荐使用了，推荐用package_data来管理，可以方便用pkg_resources里面的方法来引用其中的资源文件。具体说明请看后面。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline3">pkg_resources模块来管理读取资源文件</h2>
<div class="outline-text-2" id="text-3">
<p>
如下所示
</p>
<pre>
from pkg_resources import resource_filename
resource_stream('wise','icos/Folder-Documents.ico')
</pre>

<p>
第一个参数是模块名字，第二个参数是模块中的文件的相对路径表达。
</p>

<p>
上面的例子是resource_filename，返回的是引用的文件名。此外还有命令：resource_string，参数和resource_filename一样，除了它返回的是字节流。这个字节流可以赋值给某个变量从而直接使用，或者存储在某个文件里面。
</p>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline4">在pypi上注册你的软件</h2>
<div class="outline-text-2" id="text-4">
<p>
具体很简单，就是
</p>
<div class="highlight"><pre><span></span>python3 setup.py register
</pre></div>

<p>
你需要在pypi官网上注册一个帐号，然后你的软件不一定能够注册成功，因为很多好名字都被别人取了。。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline5">在pypi上上传你的软件</h2>
<div class="outline-text-2" id="text-5">
<div class="highlight"><pre><span></span>python3 setup.py sdist upload
</pre></div>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline6">一个项目模板</h2>
<div class="outline-text-2" id="text-6">
<p>
我在github上创建了一个小项目，这个小项目支持快速新建一个项目。
</p>

<p>
<a href="https://github.com/a358003542/skeleton"><a href="https://github.com/a358003542/skeleton">https://github.com/a358003542/skeleton</a></a> 
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">windows下的情况不清楚。</div></div>


</div>
</div></div>
</body>
</html>
